# St7SetExtrudeFlags

Sets the state of the extrude options for applicable tools operations.

long St7SetExtrudeFlags(long uID, long* Flags)

Input Parameters

uID

Strand7 model file ID.

Flags[0..0]

[ipExtrudePlateEdgeAttributes] – either btTrue or btFalse; setting for Extrude Plate Edge
Attributes.